{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<extra_id_0>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<extra_id_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<extra_id_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<extra_id_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<extra_id_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<extra_id_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "<extra_id_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "<extra_id_7>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "<extra_id_8>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "<extra_id_9>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "<extra_id_10>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "<extra_id_11>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "<extra_id_12>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "<extra_id_13>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "<extra_id_14>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "<extra_id_15>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "<extra_id_16>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "<extra_id_17>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "<extra_id_18>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "<extra_id_19>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "<extra_id_20>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 25,
      "content": "<extra_id_21>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 26,
      "content": "<extra_id_22>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 27,
      "content": "<extra_id_23>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 28,
      "content": "<extra_id_24>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 29,
      "content": "<extra_id_25>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30,
      "content": "<extra_id_26>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 31,
      "content": "<extra_id_27>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 32,
      "content": "<extra_id_28>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 33,
      "content": "<extra_id_29>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 34,
      "content": "<extra_id_30>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 35,
      "content": "<extra_id_31>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 36,
      "content": "<extra_id_32>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 37,
      "content": "<extra_id_33>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 38,
      "content": "<extra_id_34>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 39,
      "content": "<extra_id_35>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 40,
      "content": "<extra_id_36>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 41,
      "content": "<extra_id_37>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 42,
      "content": "<extra_id_38>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 43,
      "content": "<extra_id_39>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 44,
      "content": "<extra_id_40>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 45,
      "content": "<extra_id_41>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 46,
      "content": "<extra_id_42>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 47,
      "content": "<extra_id_43>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 48,
      "content": "<extra_id_44>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 49,
      "content": "<extra_id_45>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 50,
      "content": "<extra_id_46>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 51,
      "content": "<extra_id_47>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 52,
      "content": "<extra_id_48>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 53,
      "content": "<extra_id_49>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 54,
      "content": "<extra_id_50>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 55,
      "content": "<extra_id_51>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 56,
      "content": "<extra_id_52>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 57,
      "content": "<extra_id_53>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 58,
      "content": "<extra_id_54>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 59,
      "content": "<extra_id_55>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 60,
      "content": "<extra_id_56>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 61,
      "content": "<extra_id_57>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 62,
      "content": "<extra_id_58>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 63,
      "content": "<extra_id_59>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 64,
      "content": "<extra_id_60>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 65,
      "content": "<extra_id_61>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 66,
      "content": "<extra_id_62>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 67,
      "content": "<extra_id_63>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 68,
      "content": "<extra_id_64>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 69,
      "content": "<extra_id_65>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 70,
      "content": "<extra_id_66>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 71,
      "content": "<extra_id_67>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 72,
      "content": "<extra_id_68>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 73,
      "content": "<extra_id_69>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 74,
      "content": "<extra_id_70>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 75,
      "content": "<extra_id_71>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 76,
      "content": "<extra_id_72>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 77,
      "content": "<extra_id_73>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 78,
      "content": "<extra_id_74>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 79,
      "content": "<extra_id_75>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 80,
      "content": "<extra_id_76>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 81,
      "content": "<extra_id_77>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 82,
      "content": "<extra_id_78>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 83,
      "content": "<extra_id_79>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 84,
      "content": "<extra_id_80>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 85,
      "content": "<extra_id_81>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 86,
      "content": "<extra_id_82>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 87,
      "content": "<extra_id_83>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 88,
      "content": "<extra_id_84>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 89,
      "content": "<extra_id_85>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 90,
      "content": "<extra_id_86>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 91,
      "content": "<extra_id_87>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 92,
      "content": "<extra_id_88>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 93,
      "content": "<extra_id_89>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 94,
      "content": "<extra_id_90>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 95,
      "content": "<extra_id_91>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 96,
      "content": "<extra_id_92>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 97,
      "content": "<extra_id_93>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 98,
      "content": "<extra_id_94>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 99,
      "content": "<extra_id_95>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 100,
      "content": "<extra_id_96>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 101,
      "content": "<extra_id_97>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 102,
      "content": "<extra_id_98>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 103,
      "content": "<extra_id_99>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 1,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "<s>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<extra_id_0>",
        0.0
      ],
      [
        "<extra_id_1>",
        0.0
      ],
      [
        "<extra_id_2>",
        0.0
      ],
      [
        "<extra_id_3>",
        0.0
      ],
      [
        "<extra_id_4>",
        0.0
      ],
      [
        "<extra_id_5>",
        0.0
      ],
      [
        "<extra_id_6>",
        0.0
      ],
      [
        "<extra_id_7>",
        0.0
      ],
      [
        "<extra_id_8>",
        0.0
      ],
      [
        "<extra_id_9>",
        0.0
      ],
      [
        "<extra_id_10>",
        0.0
      ],
      [
        "<extra_id_11>",
        0.0
      ],
      [
        "<extra_id_12>",
        0.0
      ],
      [
        "<extra_id_13>",
        0.0
      ],
      [
        "<extra_id_14>",
        0.0
      ],
      [
        "<extra_id_15>",
        0.0
      ],
      [
        "<extra_id_16>",
        0.0
      ],
      [
        "<extra_id_17>",
        0.0
      ],
      [
        "<extra_id_18>",
        0.0
      ],
      [
        "<extra_id_19>",
        0.0
      ],
      [
        "<extra_id_20>",
        0.0
      ],
      [
        "<extra_id_21>",
        0.0
      ],
      [
        "<extra_id_22>",
        0.0
      ],
      [
        "<extra_id_23>",
        0.0
      ],
      [
        "<extra_id_24>",
        0.0
      ],
      [
        "<extra_id_25>",
        0.0
      ],
      [
        "<extra_id_26>",
        0.0
      ],
      [
        "<extra_id_27>",
        0.0
      ],
      [
        "<extra_id_28>",
        0.0
      ],
      [
        "<extra_id_29>",
        0.0
      ],
      [
        "<extra_id_30>",
        0.0
      ],
      [
        "<extra_id_31>",
        0.0
      ],
      [
        "<extra_id_32>",
        0.0
      ],
      [
        "<extra_id_33>",
        0.0
      ],
      [
        "<extra_id_34>",
        0.0
      ],
      [
        "<extra_id_35>",
        0.0
      ],
      [
        "<extra_id_36>",
        0.0
      ],
      [
        "<extra_id_37>",
        0.0
      ],
      [
        "<extra_id_38>",
        0.0
      ],
      [
        "<extra_id_39>",
        0.0
      ],
      [
        "<extra_id_40>",
        0.0
      ],
      [
        "<extra_id_41>",
        0.0
      ],
      [
        "<extra_id_42>",
        0.0
      ],
      [
        "<extra_id_43>",
        0.0
      ],
      [
        "<extra_id_44>",
        0.0
      ],
      [
        "<extra_id_45>",
        0.0
      ],
      [
        "<extra_id_46>",
        0.0
      ],
      [
        "<extra_id_47>",
        0.0
      ],
      [
        "<extra_id_48>",
        0.0
      ],
      [
        "<extra_id_49>",
        0.0
      ],
      [
        "<extra_id_50>",
        0.0
      ],
      [
        "<extra_id_51>",
        0.0
      ],
      [
        "<extra_id_52>",
        0.0
      ],
      [
        "<extra_id_53>",
        0.0
      ],
      [
        "<extra_id_54>",
        0.0
      ],
      [
        "<extra_id_55>",
        0.0
      ],
      [
        "<extra_id_56>",
        0.0
      ],
      [
        "<extra_id_57>",
        0.0
      ],
      [
        "<extra_id_58>",
        0.0
      ],
      [
        "<extra_id_59>",
        0.0
      ],
      [
        "<extra_id_60>",
        0.0
      ],
      [
        "<extra_id_61>",
        0.0
      ],
      [
        "<extra_id_62>",
        0.0
      ],
      [
        "<extra_id_63>",
        0.0
      ],
      [
        "<extra_id_64>",
        0.0
      ],
      [
        "<extra_id_65>",
        0.0
      ],
      [
        "<extra_id_66>",
        0.0
      ],
      [
        "<extra_id_67>",
        0.0
      ],
      [
        "<extra_id_68>",
        0.0
      ],
      [
        "<extra_id_69>",
        0.0
      ],
      [
        "<extra_id_70>",
        0.0
      ],
      [
        "<extra_id_71>",
        0.0
      ],
      [
        "<extra_id_72>",
        0.0
      ],
      [
        "<extra_id_73>",
        0.0
      ],
      [
        "<extra_id_74>",
        0.0
      ],
      [
        "<extra_id_75>",
        0.0
      ],
      [
        "<extra_id_76>",
        0.0
      ],
      [
        "<extra_id_77>",
        0.0
      ],
      [
        "<extra_id_78>",
        0.0
      ],
      [
        "<extra_id_79>",
        0.0
      ],
      [
        "<extra_id_80>",
        0.0
      ],
      [
        "<extra_id_81>",
        0.0
      ],
      [
        "<extra_id_82>",
        0.0
      ],
      [
        "<extra_id_83>",
        0.0
      ],
      [
        "<extra_id_84>",
        0.0
      ],
      [
        "<extra_id_85>",
        0.0
      ],
      [
        "<extra_id_86>",
        0.0
      ],
      [
        "<extra_id_87>",
        0.0
      ],
      [
        "<extra_id_88>",
        0.0
      ],
      [
        "<extra_id_89>",
        0.0
      ],
      [
        "<extra_id_90>",
        0.0
      ],
      [
        "<extra_id_91>",
        0.0
      ],
      [
        "<extra_id_92>",
        0.0
      ],
      [
        "<extra_id_93>",
        0.0
      ],
      [
        "<extra_id_94>",
        0.0
      ],
      [
        "<extra_id_95>",
        0.0
      ],
      [
        "<extra_id_96>",
        0.0
      ],
      [
        "<extra_id_97>",
        0.0
      ],
      [
        "<extra_id_98>",
        0.0
      ],
      [
        "<extra_id_99>",
        0.0
      ],
      [
        "▁",
        -1.9768590927124023
      ],
      [
        ".",
        -3.012237310409546
      ],
      [
        "(",
        -3.1901557445526123
      ],
      [
        ",",
        -3.8279871940612793
      ],
      [
        ")",
        -3.8284037113189697
      ],
      [
        "▁{",
        -3.8325581550598145
      ],
      [
        "▁}",
        -4.0528388023376465
      ],
      [
        "▁=",
        -4.059053421020508
      ],
      [
        ");",
        -4.139339447021484
      ],
      [
        "_",
        -4.440395832061768
      ],
      [
        ";",
        -4.537032604217529
      ],
      [
        "▁(",
        -4.7426934242248535
      ],
      [
        "s",
        -4.802083969116211
      ],
      [
        "\r",
        -4.842333793640137
      ],
      [
        "▁if",
        -4.84768533706665
      ],
      [
        "<",
        -4.960929870605469
      ],
      [
        "get",
        -5.064920425415039
      ],
      [
        "▁new",
        -5.090153217315674
      ],
      [
        "▁return",
        -5.0946431159973145
      ],
      [
        "();",
        -5.160754680633545
      ],
      [
        "▁null",
        -5.174736499786377
      ],
      [
        "▁public",
        -5.243465423583984
      ],
      [
        "}",
        -5.249141216278076
      ],
      [
        ">",
        -5.2687668800354
      ],
      [
        "▁//",
        -5.447709560394287
      ],
      [
        "String",
        -5.465954303741455
      ],
      [
        "(\"",
        -5.4666924476623535
      ],
      [
        "▁+",
        -5.4987030029296875
      ],
      [
        "▁\"",
        -5.522167205810547
      ],
      [
        "()",
        -5.6047515869140625
      ],
      [
        "▁String",
        -5.6901535987854
      ],
      [
        "▁==",
        -5.710882663726807
      ],
      [
        "Exception",
        -5.7764153480529785
      ],
      [
        "▁the",
        -5.9733805656433105
      ],
      [
        "().",
        -5.981276035308838
      ],
      [
        ":",
        -6.006106376647949
      ],
      [
        "▁void",
        -6.047609806060791
      ],
      [
        "())",
        -6.057538032531738
      ],
      [
        "i",
        -6.07391881942749
      ],
      [
        "▁!=",
        -6.07737398147583
      ],
      [
        "▁int",
        -6.14732551574707
      ],
      [
        "▁final",
        -6.149296283721924
      ],
      [
        "());",
        -6.162296772003174
      ],
      [
        "▁this",
        -6.190791606903076
      ],
      [
        "if",
        -6.205596923828125
      ],
      [
        "▁for",
        -6.209339618682861
      ],
      [
        "▁else",
        -6.230578899383545
      ],
      [
        "(),",
        -6.233550071716309
      ],
      [
        "▁static",
        -6.255707263946533
      ],
      [
        "▁to",
        -6.257918834686279
      ],
      [
        "add",
        -6.2609052658081055
      ],
      [
        "\",",
        -6.266069412231445
      ],
      [
        "\");",
        -6.267175197601318
      ],
      [
        "Type",
        -6.272607803344727
      ],
      [
        "return",
        -6.276031970977783
      ],
      [
        "▁@",
        -6.289647102355957
      ],
      [
        "[",
        -6.291116714477539
      ],
      [
        "▁e",
        -6.305096626281738
      ],
      [
        "▁i",
        -6.33837890625
      ],
      [
        "set",
        -6.340893268585205
      ],
      [
        "int",
        -6.373863697052002
      ],
      [
        "▁throw",
        -6.412973880767822
      ],
      [
        "length",
        -6.466149806976318
      ],
      [
        "List",
        -6.4759650230407715
      ],
      [
        "T",
        -6.487744331359863
      ],
      [
        "final",
        -6.508272171020508
      ],
      [
        "Name",
        -6.517547607421875
      ],
      [
        "[]",
        -6.53122091293335
      ],
      [
        "▁&&",
        -6.5377888679504395
      ],
      [
        "this",
        -6.55203914642334
      ],
      [
        "▁throws",
        -6.566891670227051
      ],
      [
        "new",
        -6.591322422027588
      ],
      [
        "))",
        -6.593975067138672
      ],
      [
        "▁:",
        -6.618676662445068
      ],
      [
        "d",
        -6.647305011749268
      ],
      [
        "▁is",
        -6.690626621246338
      ],
      [
        "Override",
        -6.704555511474609
      ],
      [
        "▁catch",
        -6.718732833862305
      ],
      [
        "Id",
        -6.719949722290039
      ],
      [
        "append",
        -6.739586353302002
      ],
      [
        "));",
        -6.749792098999023
      ],
      [
        "m",
        -6.787161350250244
      ],
      [
        "2",
        -6.795674800872803
      ],
      [
        "▁try",
        -6.808834075927734
      ],
      [
        "e",
        -6.814639091491699
      ],
      [
        "is",
        -6.818795680999756
      ],
      [
        "▁a",
        -6.820502758026123
      ],
      [
        "Map",
        -6.841447830200195
      ],
      [
        "//",
        -6.841508388519287
      ],
      [
        "class",
        -6.8447771072387695
      ],
      [
        "▁boolean",
        -6.85313606262207
      ],
      [
        "▁m",
        -6.860863208770752
      ],
      [
        "t",
        -6.864621639251709
      ],
      [
        "'",
        -6.880015850067139
      ],
      [
        "-",
        -6.890927791595459
      ],
      [
        "Request",
        -6.894972801208496
      ],
      [
        "n",
        -6.9139404296875
      ],
      [
        "▁private",
        -6.919600486755371
      ],
      [
        "Object",
        -6.929087162017822
      ],
      [
        "▁0;",
        -6.932431221008301
      ],
      [
        "▁result",
        -6.94042444229126
      ],
      [
        "Value",
        -6.949307441711426
      ],
      [
        "S",
        -6.973495006561279
      ],
      [
        "Class",
        -6.989619731903076
      ],
      [
        "ed",
        -6.994924068450928
      ],
      [
        "▁value",
        -7.006842136383057
      ],
      [
        "File",
        -7.015538215637207
      ],
      [
        "/",
        -7.0480499267578125
      ],
      [
        "▁-",
        -7.064505577087402
      ],
      [
        "▁false",
        -7.071056365966797
      ],
      [
        "x",
        -7.082132339477539
      ],
      [
        "a",
        -7.084101676940918
      ],
      [
        "ing",
        -7.087647914886475
      ],
      [
        "name",
        -7.1143693923950195
      ],
      [
        "r",
        -7.1302103996276855
      ],
      [
        "size",
        -7.136058330535889
      ],
      [
        "▁true",
        -7.136271953582764
      ],
      [
        "Node",
        -7.147305965423584
      ],
      [
        "▁||",
        -7.154250621795654
      ],
      [
        "▁Object",
        -7.165323734283447
      ],
      [
        "c",
        -7.167305946350098
      ],
      [
        "1",
        -7.17625093460083
      ],
      [
        "▁in",
        -7.178042411804199
      ],
      [
        "▁(!",
        -7.189480304718018
      ],
      [
        "▁*",
        -7.190428256988525
      ],
      [
        "put",
        -7.197721481323242
      ],
      [
        "▁List",
        -7.2009968757629395
      ],
      [
        "]",
        -7.217349052429199
      ],
      [
        "▁0)",
        -7.222204208374023
      ],
      [
        "Data",
        -7.230438232421875
      ],
      [
        "equals",
        -7.246509075164795
      ],
      [
        "▁not",
        -7.258984565734863
      ],
      [
        "value",
        -7.268791198730469
      ],
      [
        "Path",
        -7.270125865936279
      ],
      [
        "\"",
        -7.276420593261719
      ],
      [
        "Key",
        -7.278017520904541
      ],
      [
        "▁request",
        -7.283146858215332
      ],
      [
        "otocolMarshaller",
        -7.306487083435059
      ],
      [
        "toString",
        -7.311665058135986
      ],
      [
        "▁of",
        -7.320376873016357
      ],
      [
        "Info",
        -7.322291851043701
      ],
      [
        "To",
        -7.323464393615723
      ],
      [
        "▁be",
        -7.32622480392456
      ],
      [
        "Context",
        -7.3487067222595215
      ],
      [
        "{",
        -7.351562976837158
      ],
      [
        "▁case",
        -7.356257915496826
      ],
      [
        "Index",
        -7.395985126495361
      ],
      [
        "D",
        -7.42328691482544
      ],
      [
        "key",
        -7.425088882446289
      ],
      [
        "f",
        -7.441341876983643
      ],
      [
        "▁?",
        -7.442593097686768
      ],
      [
        "g",
        -7.45881462097168
      ],
      [
        "▁pr",
        -7.463969707489014
      ],
      [
        "▁0",
        -7.474193096160889
      ],
      [
        "▁IOException",
        -7.479038238525391
      ],
      [
        "▁name",
        -7.48412036895752
      ],
      [
        "null",
        -7.485645771026611
      ],
      [
        "Set",
        -7.487494945526123
      ],
      [
        "p",
        -7.497324466705322
      ],
      [
        "▁and",
        -7.501849174499512
      ],
      [
        "type",
        -7.502843379974365
      ],
      [
        "▁instanceof",
        -7.509133815765381
      ],
      [
        "ID",
        -7.514747619628906
      ],
      [
        "++)",
        -7.525567054748535
      ],
      [
        "b",
        -7.533324718475342
      ],
      [
        "▁type",
        -7.535490989685059
      ],
      [
        "Element",
        -7.548465728759766
      ],
      [
        "marshall",
        -7.558202743530273
      ],
      [
        "y",
        -7.571547031402588
      ],
      [
        "getName",
        -7.580023288726807
      ],
      [
        "A",
        -7.581931591033936
      ],
      [
        "Config",
        -7.582944869995117
      ],
      [
        "▁set",
        -7.590839385986328
      ],
      [
        "3",
        -7.590969562530518
      ],
      [
        "Response",
        -7.593976974487305
      ],
      [
        "id",
        -7.603448390960693
      ],
      [
        "▁double",
        -7.60518217086792
      ],
      [
        "er",
        -7.614780902862549
      ],
      [
        "Entry",
        -7.617818832397461
      ],
      [
        "C",
        -7.62017822265625
      ],
      [
        "o",
        -7.622296810150147
      ],
      [
        ">>",
        -7.643197059631348
      ],
      [
        "Message",
        -7.643232822418213
      ],
      [
        "▁create",
        -7.646917343139648
      ],
      [
        "▁long",
        -7.646959781646728
      ],
      [
        "X",
        -7.649415493011475
      ],
      [
        "Builder",
        -7.651644706726074
      ],
      [
        "▁protected",
        -7.65357494354248
      ],
      [
        "for",
        -7.655524253845215
      ],
      [
        "Factory",
        -7.661002635955811
      ],
      [
        "Field",
        -7.663453578948975
      ],
      [
        "create",
        -7.66408109664917
      ],
      [
        "▁key",
        -7.669307231903076
      ],
      [
        "\")",
        -7.673981666564941
      ],
      [
        "I",
        -7.694905757904053
      ],
      [
        "rgumentException",
        -7.7016801834106445
      ],
      [
        "v",
        -7.704188346862793
      ],
      [
        "▁p",
        -7.711693286895752
      ],
      [
        "L",
        -7.716654300689697
      ],
      [
        "Result",
        -7.719662189483643
      ],
      [
        "request",
        -7.722522258758545
      ],
      [
        "BINDING",
        -7.732912540435791
      ],
      [
        "▁we",
        -7.7348713874816895
      ],
      [
        "E",
        -7.737689971923828
      ],
      [
        "State",
        -7.743152618408203
      ],
      [
        "▁it",
        -7.744273662567139
      ],
      [
        "=",
        -7.755197048187256
      ],
      [
        "Method",
        -7.76492977142334
      ],
      [
        "▁break",
        -7.769075870513916
      ],
      [
        "▁IllegalA",
        -7.7713942527771
      ],
      [
        "to",
        -7.780031681060791
      ],
      [
        "▁response",
        -7.785971164703369
      ],
      [
        "▁c",
        -7.787645816802979
      ],
      [
        "debug",
        -7.789585113525391
      ],
      [
        "Size",
        -7.794105052947998
      ],
      [
        "▁file",
        -7.794116497039795
      ],
      [
        "public",
        -7.7964677810668945
      ],
      [
        "Configuration",
        -7.807860374450684
      ],
      [
        "j",
        -7.811948299407959
      ],
      [
        "Resource",
        -7.812880516052246
      ],
      [
        "▁list",
        -7.8178205490112305
      ],
      [
        "Service",
        -7.818310260772705
      ],
      [
        "▁ArrayList",
        -7.820693969726563
      ],
      [
        "out",
        -7.824941635131836
      ],
      [
        "R",
        -7.827292919158936
      ],
      [
        "▁data",
        -7.828591346740723
      ],
      [
        "Count",
        -7.83908748626709
      ],
      [
        "];",
        -7.84882402420044
      ],
      [
        "▁while",
        -7.866619110107422
      ],
      [
        "F",
        -7.870659828186035
      ],
      [
        "index",
        -7.876216411590576
      ],
      [
        "Utils",
        -7.877042293548584
      ],
      [
        "next",
        -7.878906726837158
      ],
      [
        "throw",
        -7.886609077453613
      ],
      [
        "In",
        -7.89006233215332
      ],
      [
        "▁path",
        -7.891258239746094
      ],
      [
        "data",
        -7.90994930267334
      ],
      [
        "▁!",
        -7.914738655090332
      ],
      [
        "▁with",
        -7.918689250946045
      ],
      [
        "P",
        -7.920254707336426
      ],
      [
        "▁index",
        -7.927898406982422
      ],
      [
        "result",
        -7.935498237609863
      ],
      [
        "tc",
        -7.935877323150635
      ],
      [
        "Property",
        -7.939935207366943
      ],
      [
        "in",
        -7.944021224975586
      ],
      [
        "Manager",
        -7.944342136383057
      ],
      [
        "▁from",
        -7.95237398147583
      ],
      [
        "isEmpty",
        -7.952553749084473
      ],
      [
        "error",
        -7.953147888183594
      ],
      [
        "Constants",
        -7.96218204498291
      ],
      [
        "Event",
        -7.964577674865723
      ],
      [
        "▁byte",
        -7.972774028778076
      ],
      [
        "With",
        -7.974485397338867
      ],
      [
        "Handler",
        -7.974595069885254
      ],
      [
        "B",
        -7.982620716094971
      ],
      [
        "For",
        -7.985072612762451
      ],
      [
        "4",
        -7.991378307342529
      ],
      [
        "remove",
        -8.004469871520996
      ],
      [
        "Client",
        -8.006631851196289
      ],
      [
        "Async",
        -8.007433891296387
      ],
      [
        "ServiceResponse",
        -8.013296127319336
      ],
      [
        "▁b",
        -8.01364803314209
      ],
      [
        "V",
        -8.016016006469727
      ],
      [
        "Filter",
        -8.016203880310059
      ],
      [
        "▁j",
        -8.020087242126465
      ],
      [
        "▁start",
        -8.020539283752441
      ],
      [
        "getMessage",
        -8.025842666625977
      ],
      [
        "log",
        -8.027056694030762
      ],
      [
        "▁sb",
        -8.040583610534668
      ],
      [
        "Array",
        -8.042725563049316
      ],
      [
        "K",
        -8.049155235290527
      ],
      [
        "able",
        -8.053313255310059
      ],
      [
        "write",
        -8.078330039978027
      ],
      [
        "getValue",
        -8.07939624786377
      ],
      [
        "Page",
        -8.07960319519043
      ],
      [
        "O",
        -8.079646110534668
      ],
      [
        "Integer",
        -8.083939552307129
      ],
      [
        "Stream",
        -8.084970474243164
      ],
      [
        "case",
        -8.086233139038086
      ],
      [
        "Time",
        -8.094294548034668
      ],
      [
        "▁context",
        -8.100260734558105
      ],
      [
        "<?>",
        -8.10096263885498
      ],
      [
        "Properties",
        -8.101322174072266
      ],
      [
        "file",
        -8.10157585144043
      ],
      [
        "true",
        -8.102707862854004
      ],
      [
        "Table",
        -8.104408264160156
      ],
      [
        "Parameter",
        -8.104609489440918
      ],
      [
        "From",
        -8.106951713562012
      ],
      [
        "▁Map",
        -8.1101655960083
      ],
      [
        "Error",
        -8.110787391662598
      ],
      [
        "info",
        -8.113104820251465
      ],
      [
        "path",
        -8.115696907043457
      ],
      [
        "▁t",
        -8.117035865783691
      ],
      [
        "▁node",
        -8.118667602539062
      ],
      [
        "Cache",
        -8.121994018554688
      ],
      [
        "Query",
        -8.123331069946289
      ],
      [
        "format",
        -8.130839347839355
      ],
      [
        "k",
        -8.131336212158203
      ],
      [
        "▁System",
        -8.135358810424805
      ],
      [
        "▁+=",
        -8.137354850769043
      ],
      [
        "u",
        -8.13809585571289
      ],
      [
        "▁marshall",
        -8.139156341552734
      ],
      [
        "▁check",
        -8.13945198059082
      ],
      [
        "Util",
        -8.14404010772705
      ],
      [
        "▁field",
        -8.144929885864258
      ],
      [
        "Item",
        -8.145101547241211
      ],
      [
        "Enabled",
        -8.14789867401123
      ],
      [
        "Group",
        -8.154973030090332
      ],
      [
        "▁>=",
        -8.155412673950195
      ],
      [
        "▁out",
        -8.160257339477539
      ],
      [
        "Text",
        -8.166690826416016
      ],
      [
        "map",
        -8.170093536376953
      ],
      [
        "▁log",
        -8.170319557189941
      ],
      [
        "l",
        -8.171952247619629
      ],
      [
        "try",
        -8.179666519165039
      ],
      [
        "start",
        -8.184098243713379
      ],
      [
        "▁on",
        -8.19075870513916
      ],
      [
        "Status",
        -8.191587448120117
      ],
      [
        "▁extends",
        -8.196220397949219
      ],
      [
        "Connection",
        -8.20630168914795
      ],
      [
        "Impl",
        -8.208992958068848
      ],
      [
        "View",
        -8.210311889648438
      ],
      [
        "Model",
        -8.211092948913574
      ],
      [
        "long",
        -8.212448120117188
      ],
      [
        "▁method",
        -8.219127655029297
      ],
      [
        "Listener",
        -8.22587776184082
      ],
      [
        "byte",
        -8.229976654052734
      ],
      [
        "entry",
        -8.230447769165039
      ],
      [
        "▁that",
        -8.231078147888184
      ],
      [
        "▁r",
        -8.232142448425293
      ],
      [
        "NAME",
        -8.235528945922852
      ],
      [
        "substring",
        -8.238289833068848
      ],
      [
        "Invalid",
        -8.241129875183105
      ],
      [
        "▁ex",
        -8.2435884475708
      ],
      [
        "▁0,",
        -8.244030952453613
      ],
      [
        "▁->",
        -8.244089126586914
      ],
      [
        "Attribute",
        -8.244399070739746
      ],
      [
        "Token",
        -8.245401382446289
      ],
      [
        "▁current",
        -8.245662689208984
      ],
      [
        "Expression",
        -8.246109962463379
      ],
      [
        "▁input",
        -8.246963500976562
      ],
      [
        "▁entry",
        -8.249277114868164
      ],
      [
        "build",
        -8.255646705627441
      ],
      [
        "▁File",
        -8.258315086364746
      ],
      [
        "\";",
        -8.258810043334961
      ],
      [
        "Instance",
        -8.260643005371094
      ],
      [
        "G",
        -8.264047622680664
      ],
      [
        "Number",
        -8.266314506530762
      ],
      [
        "Date",
        -8.273792266845703
      ],
      [
        "*",
        -8.27736759185791
      ],
      [
        "▁target",
        -8.278219223022461
      ],
      [
        "client",
        -8.283246040344238
      ],
      [
        "▁buffer",
        -8.284438133239746
      ],
      [
        ".\");",
        -8.286888122558594
      ],
      [
        "Collection",
        -8.289249420166016
      ],
      [
        "▁message",
        -8.29172134399414
      ],
      [
        "close",
        -8.295304298400879
      ],
      [
        "▁tc",
        -8.296333312988281
      ],
      [
        "contains",
        -8.300226211547852
      ],
      [
        "input",
        -8.302990913391113
      ],
      [
        "w",
        -8.30431079864502
      ],
      [
        "▁end",
        -8.307787895202637
      ],
      [
        "0",
        -8.308823585510254
      ],
      [
        "h",
        -8.309513092041016
      ],
      [
        "▁Integer",
        -8.309796333312988
      ],
      [
        "node",
        -8.314570426940918
      ],
      [
        "Y",
        -8.318390846252441
      ],
      [
        "read",
        -8.324966430664062
      ],
      [
        "println",
        -8.327531814575195
      ],
      [
        "▁SdkClient",
        -8.329330444335938
      ],
      [
        "▁x",
        -8.32973861694336
      ],
      [
        "N",
        -8.334827423095703
      ],
      [
        "1,",
        -8.340882301330566
      ],
      [
        "\"))",
        -8.341280937194824
      ],
      [
        "▁T",
        -8.34130573272705
      ],
      [
        "▁StringBuilder",
        -8.346492767333984
      ],
      [
        "Level",
        -8.347574234008789
      ],
      [
        "Code",
        -8.348639488220215
      ],
      [
        "▁n",
        -8.352697372436523
      ],
      [
        "Length",
        -8.354626655578613
      ],
      [
        "list",
        -8.355122566223145
      ],
      [
        "System",
        -8.355835914611816
      ],
      [
        "▁1)",
        -8.357538223266602
      ],
      [
        "U",
        -8.359235763549805
      ],
      [
        ">();",
        -8.359938621520996
      ],
      [
        "current",
        -8.36156177520752
      ],
      [
        "+",
        -8.363765716552734
      ],
      [
        "By",
        -8.363810539245605
      ],
      [
        "▁1;",
        -8.364150047302246
      ],
      [
        "Task",
        -8.366926193237305
      ],
      [
        "Url",
        -8.369458198547363
      ],
      [
        "User",
        -8.37142562866211
      ],
      [
        "▁service",
        -8.373964309692383
      ],
      [
        "double",
        -8.376087188720703
      ],
      [
        "▁read",
        -8.376944541931152
      ],
      [
        "▁Class",
        -8.377067565917969
      ],
      [
        "▁max",
        -8.379467010498047
      ],
      [
        "▁do",
        -8.3798246383667
      ],
      [
        "▁super",
        -8.379897117614746
      ],
      [
        "▁&",
        -8.380958557128906
      ],
      [
        "TYPE",
        -8.381516456604004
      ],
      [
